#+title: My simple NixOS config

* Introduce

It's a NixOS config using [[https://github.com/snowfallorg/lib][snowfall]].

Almost all files in ~modules~ folder are minimal nix modules, its path is module option path.

For example:

#+begin_src nix
# modules/home/cli/android/default.nix
{
  nixPkgs = "apkeep";
  enable = "fdroidcl";
}
#+end_src

it will convert to:

#+begin_src nix
{
  lib,
  config,
  namespace,
  pkgs,
  ...
}:
let
  # folder path as option path
  cfg = config.${namespace}.cli.android;
in
{
  # create an enable option by default
  options.${namespace}.cli.android.enable = lib.mkOption {
    type = lib.types.bool;
    default = false;
    description = null;
  };

  config = lib.mkIf cfg.enable {
    home.packages = [ pkgs.apkeep ];

    # sub folder
    ${namespace}.cli.android.fdroidcl.enable = true;
  };
}
#+end_src

so, just a simple, lazy config.

* Waiting list

#+name: waiting list
#+begin_src sqlite :db waiting.db :colnames yes
select * from v_packages
#+end_src

#+RESULTS: waiting list
| package                            | description                                                                                                                                                                                                                                                                                                                                      |
|------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [[https://github.com/raviqqe/schemat][schemat]]                            | Code formatter for Scheme, Lisp, and any S-expressions                                                                                                                                                                                                                                                                                           |
| [[https://github.com/mulaRahul/keyviz][keyviz]]                             | Keyviz is a free and open-source tool to visualize your keystrokes ⌨️ and 🖱️ mouse actions in real-time.                                                                                                                                                                                                                                         |
| [[https://github.com/picosh/git-pr][git-pr]]                             | the easiest git collaboration tool                                                                                                                                                                                                                                                                                                               |
| [[https://github.com/varbhat/cvtek][cvtek]]                              | 📄 Craft your Resume/CV using TOML                                                                                                                                                                                                                                                                                                               |
| [[https://github.com/Ragnt/AngryOxide][AngryOxide]]                         | 802.11 Attack Tool                                                                                                                                                                                                                                                                                                                               |
| [[https://github.com/robertpsoane/ducker][ducker]]                             | A slightly quackers Docker TUI based on k9s 🦆                                                                                                                                                                                                                                                                                                   |
| [[https://github.com/SergioRibera/simplemoji][simplemoji]]                         | Fast Application for look your amazing emojis write in Rust                                                                                                                                                                                                                                                                                      |
| [[https://github.com/nwg-piotr/azote][azote]]                              | Wallpaper manager for wlroots-based compositors and some other WMs                                                                                                                                                                                                                                                                               |
| [[https://github.com/aitjcize/cppman][cppman]]                             | C++ 98/11/14 manual pages for Linux/MacOS                                                                                                                                                                                                                                                                                                        |
| [[https://github.com/Duckonaut/split-monitor-workspaces][split-monitor-workspaces]]           | A small Hyprland plugin to provide awesome-like workspace behavior                                                                                                                                                                                                                                                                               |
| [[https://github.com/ArthurSonzogni/Diagon][Diagon]]                             | Interactive ASCII art diagram generators. 🌟                                                                                                                                                                                                                                                                                                     |
| [[http://greenfishsoftware.org/gfie.php][gfie]]                               | Greenfish Icon Editor Pro (GFIE Pro) is a powerful freeware image editor, especially suitable for creating icons, cursors, animations and icon libraries.                                                                                                                                                                                        |
| [[https://github.com/superbrothers/opener][opener]]                             | Open URL in your local web browser from the SSH-connected remote environment.                                                                                                                                                                                                                                                                    |
| [[https://github.com/ShadowBlip/InputPlumber][InputPlumber]]                       | Open source input router and remapper daemon for Linux                                                                                                                                                                                                                                                                                           |
| [[https://github.com/projectdiscovery/urlfinder][urlfinder]]                          | A high-speed tool for passively gathering URLs, optimized for efficient and comprehensive web asset discovery without active scanning.                                                                                                                                                                                                           |
| [[https://suyu.dev][suyu]]                               | Experimental Nintendo Switch emulator written in C++                                                                                                                                                                                                                                                                                             |
| [[https://github.com/rustic-rs/rustic][rustic]]                             | rustic - fast, encrypted, and deduplicated backups powered by Rust                                                                                                                                                                                                                                                                               |
| [[https://www.itgmania.com/][itgmania]]                           | A fork of StepMania 5.1, improved for the post-ITG community!                                                                                                                                                                                                                                                                                    |
| [[https://github.com/nik-rev/patchy][patchy]]                             | A tool which makes it easy to declaratively manage personal forks by automatically merging pull requests                                                                                                                                                                                                                                         |
| [[https://mkniewallner.github.io/migrate-to-uv/][migrate-to-uv]]                      | migrate-to-uv migrates a project to uv from another package manager.                                                                                                                                                                                                                                                                             |
| [[https://kantord.github.io/SeaGOAT/latest/][SeaGOAT]]                            | A code search engine for the AI age.                                                                                                                                                                                                                                                                                                             |
| [[https://github.com/diced/zipline][zipline]]                            | A ShareX/file upload server that is easy to use, packed with features, and with an easy setup!                                                                                                                                                                                                                                                   |
| [[https://github.com/ffizer/ffizer][ffizer]]                             | ffizer is a files and folders initializer / generator. Create any kind (or part) of project from template.                                                                                                                                                                                                                                       |
| [[https://git.sr.ht/~gsthnz/gssg][gssg]]                               | A gemini static site generator                                                                                                                                                                                                                                                                                                                   |
| [[https://github.com/PowerShell/PowerShellEditorServices][PowerShellEditorServices]]           | Common platform for PowerShell development support in any editor or application                                                                                                                                                                                                                                                                  |
| [[https://github.com/alexwforsythe/tmux-which-key][tmux-which-key]]                     | Tmux plugin that allows users to select actions from a customizable popup menu                                                                                                                                                                                                                                                                   |
| [[https://codeberg.org/readeck/readeck][readeck]]                            | Readeck is a simple web application that lets you save the precious readable content of web pages you like and want to keep forever.                                                                                                                                                                                                             |
| [[https://github.com/ShadowBlip/PowerStation][PowerStation]]                       | Open source TDP control and performance daemon with DBus interface                                                                                                                                                                                                                                                                               |
| [[https://github.com/dhonus/jellyfin-tui][jellyfin-tui]]                       | 🪼 Music streaming client for the terminal                                                                                                                                                                                                                                                                                                       |
| [[https://github.com/qxb3/fum][fum]]                                | A fully customizable tui-based mpris music client.                                                                                                                                                                                                                                                                                               |
| [[https://github.com/sourcegit-scm/sourcegit][sourcegit]]                          | Windows/macOS/Linux GUI client for GIT users                                                                                                                                                                                                                                                                                                     |
| [[https://github.com/Oughie/clock-rs][clock-rs]]                           | clock-rs - A clock for your terminal!                                                                                                                                                                                                                                                                                                            |
| [[https://github.com/3timeslazy/nix-search-tv][nix-search-tv]]                      | Fuzzy search for Nix packages.                                                                                                                                                                                                                                                                                                                   |
| [[https://github.com/medialab/xan][xan]]                                | The CSV magician                                                                                                                                                                                                                                                                                                                                 |
| [[https://github.com/filiptibell/tooling-language-server][tooling-language-server]]            | A language server for tools & package managers                                                                                                                                                                                                                                                                                                   |
| [[https://github.com/usememos/telegram-integration][telegram-integration]]               | Memogram is an easy to use integration service for syncing messages and images from a Telegram bot into your Memos.                                                                                                                                                                                                                              |
| [[https://github.com/glennj/exercism-cli-fish-wrapper][exercism-cli-fish-wrapper]]          | A fish wrapper for the Exercism CLI                                                                                                                                                                                                                                                                                                              |
| [[https://github.com/JohanChane/clashtui][clashtui]]                           | Mihomo (Clash.Meta) TUI Client                                                                                                                                                                                                                                                                                                                   |
| [[https://github.com/mhersson/mpls][mpls]]                               | Markdown Preview Language Server                                                                                                                                                                                                                                                                                                                 |
| [[https://github.com/YS-L/flamelens][flamelens]]                          | Flamegraph viewer in the terminal                                                                                                                                                                                                                                                                                                                |
| [[https://github.com/flox/t3][t3]]                                 | Next generation tee with colorized output streams and precise time stamping                                                                                                                                                                                                                                                                      |
| [[https://github.com/Open-Wine-Components/umu-launcher][umu-launcher]]                       |                                                                                                                                                                                                                                                                                                                                                  |
| [[https://github.com/hunkyburrito/xdg-desktop-portal-termfilechooser][xdg-desktop-portal-termfilechooser]] | xdg-desktop-portal backend for choosing files with your favorite file chooser                                                                                                                                                                                                                                                                    |
| [[https://github.com/antfu-collective/ni][ni]]                                 | 💡 Use the right package manager                                                                                                                                                                                                                                                                                                                 |
| [[https://github.com/uros-5/jinja-lsp][jinja-lsp]]                          | Language Server for jinja                                                                                                                                                                                                                                                                                                                        |
| [[https://github.com/biliup/biliup-rs][biliup-rs]]                          | 命令行投稿(B站)和视频下载工具，提供多种登录方式，支持多p。                                                                                                                                                                                                                                                                                                |
| [[https://github.com/ddelabru/world-wall-clock][world-wall-clock]]                   | world-wall-clock is a TUI application that provides a multi-timezone graphical clock in a terminal environment.                                                                                                                                                                                                                                  |
| [[https://github.com/victoralvesf/aonsoku][aonsoku]]                            | A modern desktop client for Navidrome/Subsonic servers built with React and Rust.                                                                                                                                                                                                                                                                |
| [[https://github.com/estin/simple-completion-language-server][simple-completion-language-server]]  | Language server to enable word completion and snippets for Helix editor                                                                                                                                                                                                                                                                          |
| [[https://github.com/antfu-collective/taze][taze]]                               | 🥦 A modern cli tool that keeps your deps fresh                                                                                                                                                                                                                                                                                                  |
| [[https://github.com/Levizor/tray-tui][tray-tui]]                           | System tray in your terminal                                                                                                                                                                                                                                                                                                                     |
| [[https://github.com/liberodark/hot-resize][hot-resize]]                         | A tool for hot resizing (without reboot) disk partitions and filesystems.                                                                                                                                                                                                                                                                        |
| [[https://github.com/nilaoda/N_m3u8DL-RE][N_m3u8DL-RE]]                        | Cross-Platform, modern and powerful stream downloader for MPD/M3U8/ISM. English/简体中文/繁體中文.                                                                                                                                                                                                                                                 |
| [[https://github.com/bakito/kubexporter][kubexporter]]                        | 📥 easily export your k8s resources                                                                                                                                                                                                                                                                                                              |
| [[https://github.com/michaelstepner/pandoc-mustache][pandoc-mustache]]                    | Pandoc filter for variable substitution using Mustache syntax                                                                                                                                                                                                                                                                                    |
| [[https://github.com/meowrch/rofi-network-manager][rofi-network-manager]]               | 🛠 Manage wifi and ethernet with rofi.                                                                                                                                                                                                                                                                                                           |
| [[https://github.com/risicle/nix-heuristic-gc][nix-heuristic-gc]]                   | A more discerning cousin of nix-collect-garbage                                                                                                                                                                                                                                                                                                  |
| [[https://github.com/wangyu-/UDPspeeder][UDPspeeder]]                         | A Tunnel which Improves your Network Quality on a High-latency Lossy Link by using Forward Error Correction, possible for All Traffics(TCP/UDP/ICMP)                                                                                                                                                                                             |
| [[https://github.com/omerxx/tmux-sessionx][tmux-sessionx]]                      | A Tmux session manager, with preview, fuzzy finding, and MORE                                                                                                                                                                                                                                                                                    |
| [[https://github.com/yassinebenaid/bunster][bunster]]                            | Compile shell scripts to static binaries.                                                                                                                                                                                                                                                                                                        |
| [[https://github.com/noborus/guesswidth][guesswidth]]                         | Guess the width (fwf)  output without delimiters in commands that output to the terminal.                                                                                                                                                                                                                                                        |
| [[https://github.com/itchyny/bed][bed]]                                | Binary editor written in Go                                                                                                                                                                                                                                                                                                                      |
| [[https://github.com/theimpostor/osc][osc]]                                | Access the system clipboard from anywhere using the ANSI OSC52 sequence                                                                                                                                                                                                                                                                          |
| [[https://github.com/hydralauncher/hydra][hydra]]                              | Hydra Launcher is an open-source gaming platform created to be the single tool that you need                                                                                                                                                                                                                                                     |
| [[https://github.com/hangyav/textLSP][textLSP]]                            | Language server for text spell and grammar check with various tools.                                                                                                                                                                                                                                                                             |
| [[https://github.com/ninoseki/uv-sort][uv-sort]]                            | Sort uv's dependencies alphabetically                                                                                                                                                                                                                                                                                                            |
| [[https://github.com/tpope/vim-apathy/][vim-apathy]]                         | apathy.vim: Set the 'path' option for miscellaneous file types                                                                                                                                                                                                                                                                                   |
| [[https://github.com/yshavit/mdq][mdq]]                                | like jq but for Markdown: find specific elements in a md doc                                                                                                                                                                                                                                                                                     |
| [[https://github.com/jellyflix-app/jellyflix][jellyflix]]                          | Jellyfix is an easy-to-use Jellyfin client for movies and shows. It's cross-platform and supports Mobile (iOS, Android) and Desktop (Windows, Mac, Linux).                                                                                                                                                                                       |
| [[https://github.com/Kagamma/tparted][tparted]]                            | Text-based user interface (TUI) frontend for parted: A simple, user-friendly utility for creating, reorganizing, and deleting disk partitions, based on Turbo/Free Vision application framework.                                                                                                                                                 |
| [[http://www.proftpd.org/][proftpd]]                            | Highly configurable GPL-licensed FTP server software                                                                                                                                                                                                                                                                                             |
| [[https://github.com/koki-develop/clive][clive]]                              | ⚡ Automates terminal operations.                                                                                                                                                                                                                                                                                                                |
| [[https://github.com/devemio/docker-color-output][docker-color-output]]                | 🎨 Docker color output which improves readability.                                                                                                                                                                                                                                                                                               |
| [[https://bpfilter.io/][bpfilter]]                           | An eBPF-based packet filtering framework.                                                                                                                                                                                                                                                                                                        |
| [[https://github.com/oligot/go-mod-upgrade/][go-mod-upgrade]]                     | Update outdated Go dependencies interactively                                                                                                                                                                                                                                                                                                    |
| [[https://github.com/streetturtle/awesome-wm-widgets][awesome-wm-widgets]]                 | Widgets for Awesome Window Manager                                                                                                                                                                                                                                                                                                               |
| [[https://github.com/psacawa/systemd-language-server][systemd-language-server]]            | Language Server for Systemd unit files                                                                                                                                                                                                                                                                                                           |
| [[https://github.com/dotnet/docfx][docfx]]                              | Static site generator for .NET API documentation.                                                                                                                                                                                                                                                                                                |
| [[https://github.com/BretFisher/docker-vackup][docker-vackup]]                      | Script to easily backup and restore docker volumes                                                                                                                                                                                                                                                                                               |
| [[https://codeberg.org/derat/soundalike][soundalike]]                         | soundalike is a command-line program that tries to find similar audio files by comparing acoustic fingerprints. Its main focus is identifying duplicate songs in music collections.                                                                                                                                                              |
| [[https://github.com/mattn/bsky][bsky]]                               | A cli application for bluesky social                                                                                                                                                                                                                                                                                                             |
| [[https://tjkeller.xyz/projects/pavolctld/][pavolctld]]                          | pavolctld is a minimal volume control daemon for PulseAudio written in C.                                                                                                                                                                                                                                                                        |
| [[https://github.com/Forceu/Gokapi][Gokapi]]                             | Lightweight selfhosted Firefox Send alternative without public upload. AWS S3 supported.                                                                                                                                                                                                                                                         |
| [[https://etternaonline.com/][etterna]]                            | Advanced cross-platform rhythm game focused on keyboard play                                                                                                                                                                                                                                                                                     |
| [[https://github.com/nikstur/lon][lon]]                                | Lock & update Nix dependencies                                                                                                                                                                                                                                                                                                                   |
| [[https://github.com/sinclairtarget/git-who][git-who]]                            | Git blame for file trees                                                                                                                                                                                                                                                                                                                         |
| [[https://github.com/arthaud/git-dumper][git-dumper]]                         | A tool to dump a git repository from a website                                                                                                                                                                                                                                                                                                   |
| [[https://github.com/vaaandark/dioxionary][dioxionary]]                         | StarDict in Rust! 使用 离线 / 在线 词典在终端中查单词、背单词！                                                                                                                                                                                                                                                                                         |
| [[https://www.roomarranger.com/][roomarranger]]                       | Room Arranger is a 3D room / apartment / floor planner with a simple user interface.                                                                                                                                                                                                                                                             |
| [[https://github.com/jbensmann/mouseless][mouseless]]                          | A replacement for the mouse in Linux                                                                                                                                                                                                                                                                                                             |
| [[https://github.com/spencerwi/cliflux][cliflux]]                            | A terminal client for Miniflux RSS reader                                                                                                                                                                                                                                                                                                        |
| [[https://github.com/chrishrb/go-grip][go-grip]]                            | Preview Markdown files locally before committing them.                                                                                                                                                                                                                                                                                           |
| [[https://omnix.page][omnix]]                              | Nix companion to improve developer experience                                                                                                                                                                                                                                                                                                    |
| [[https://github.com/TypedDevs/bashunit][bashunit]]                           | A simple testing library for bash scripts. Test your bash scripts in the fastest and simplest way.                                                                                                                                                                                                                                               |
| [[https://github.com/Everduin94/better-commits][better-commits]]                     | A CLI for creating better commits following the conventional commits specification                                                                                                                                                                                                                                                               |
| [[https://github.com/broofa/runmd][runmd]]                              | Executable markdown files                                                                                                                                                                                                                                                                                                                        |
| [[https://github.com/TimothyYe/godns][godns]]                              | A dynamic DNS client tool that supports AliDNS, Cloudflare, Google Domains, DNSPod, HE.net & DuckDNS & DreamHost, etc, written in Go.                                                                                                                                                                                                            |
| [[https://github.com/krillinai/KrillinAI][KrillinAI]]                          | A video translation and dubbing tool powered by LLMs, offering professional-grade translations and one-click full-process deployment. It can generate content optimized for platforms like YouTube，TikTok, and Shorts.  基于AI大模型的视频翻译和配音工具，专业级翻译，一键部署全流程，可以生成适配抖音，小红书，哔哩哔哩，视频号，TikTok，Youtube Shorts等形态的内容 |
| [[https://github.com/nik-rev/ferrishot][ferrishot]]                          | A powerful screenshot app written in Rust 📸🦀                                                                                                                                                                                                                                                                                                   |
| [[https://github.com/drupol/markdown-code-runner][markdown-code-runner]]               | Execute and optionally rewrite code blocks in Markdown files based on external commands                                                                                                                                                                                                                                                          |
| [[https://github.com/openai/codex][codex]]                              | Lightweight coding agent that runs in your terminal                                                                                                                                                                                                                                                                                              |
| [[https://github.com/Equationzhao/g][g-ls]]                               | powerful and cross-platform ls 🌈                                                                                                                                                                                                                                                                                                                |
| [[https://github.com/Zephyruso/zashboard][zashboard]]                          | A Dashboard Using Clash API                                                                                                                                                                                                                                                                                                                      |
| [[https://github.com/byawitz/ggh][ggh]]                                | Recall your SSH sessions (also search your SSH config file)                                                                                                                                                                                                                                                                                      |
| [[https://github.com/Arnau478/hevi][hevi]]                               | Hex viewer                                                                                                                                                                                                                                                                                                                                       |
| [[https://github.com/KNawm/speed-cloudflare-cli][speed-cloudflare-cli]]               | 📈 Measure the speed and consistency of your internet connection using speed.cloudflare.com                                                                                                                                                                                                                                                      |
| [[https://github.com/patrickhener/goshs][goshs]]                              | A SimpleHTTPServer written in Go, enhanced with features and with a nice design - https://goshs.de                                                                                                                                                                                                                                               |
| [[https://github.com/blopker/codebook][codebook]]                           | Spell Checker for Code                                                                                                                                                                                                                                                                                                                           |
| [[https://github.com/terror/just-lsp][just-lsp]]                           | A language server for just                                                                                                                                                                                                                                                                                                                       |
| [[https://github.com/open-ani/animeko][animeko]]                            | 集找番、追番、看番的一站式弹幕追番平台，云收藏同步 (Bangumi)，离线缓存，BitTorrent，弹幕云过滤。100% Kotlin/Compose Multiplatform                                                                                                                                                                                                                             |
| [[https://github.com/drdo/redu][redu]]                               | ncdu for your restic repository                                                                                                                                                                                                                                                                                                                  |
| [[https://github.com/cooklang/cookcli][cookcli]]                            | Command line program which provides a suite of tools to create shopping lists and maintain recipes.                                                                                                                                                                                                                                              |
| [[https://github.com/karakeep-app/karakeep][karakeep]]                           | A self-hostable bookmark-everything app (links, notes and images) with AI-based automatic tagging and full text search                                                                                                                                                                                                                           |
| [[https://github.com/myint/scspell][scspell]]                            | Spell checker for source code                                                                                                                                                                                                                                                                                                                    |
| [[https://github.com/beyond-all-reason/Beyond-All-Reason][Beyond-All-Reason]]                  | Main game repository for Beyond All Reason.                                                                                                                                                                                                                                                                                                      |
| [[https://gitlab.com/azymohliad/qwertone][qwertone]]                           | Turns your PC into music instrument                                                                                                                                                                                                                                                                                                              |
| [[https://github.com/nkanaev/yarr][yarr]]                               | yet another rss reader                                                                                                                                                                                                                                                                                                                           |
| [[https://github.com/linkdd/regname?tab=readme-ov-file][regname]]                            | Mass renamer TUI written in Rust                                                                                                                                                                                                                                                                                                                 |
| [[https://github.com/kpcyrd/repro-env][repro-env]]                          | Dependency lockfiles for reproducible build environments 📦🔒                                                                                                                                                                                                                                                                                    |
| [[https://github.com/bahdotsh/wrkflw][wrkflw]]                             | Validate and execute GitHub Actions workflows locally.                                                                                                                                                                                                                                                                                           |
| [[https://github.com/hougesen/mdsf][mdsf]]                               | Format markdown code blocks using your favorite tools                                                                                                                                                                                                                                                                                            |
| [[https://github.com/OliveTin/OliveTin][OliveTin]]                           | OliveTin gives safe and simple access to predefined shell commands from a web interface.                                                                                                                                                                                                                                                         |
| [[https://github.com/Breakthrough/PySceneDetect][PySceneDetect]]                      | :movie_camera: Python and OpenCV-based scene cut/transition detection program & library.                                                                                                                                                                                                                                                         |
| [[https://github.com/noperator/jqfmt][jqfmt]]                              | like gofmt, but for jq                                                                                                                                                                                                                                                                                                                           |
| [[https://github.com/flattool/warehouse][warehouse]]                          | A versatile toolbox for viewing flatpak info, managing user data, and batch managing installed flatpaks                                                                                                                                                                                                                                          |
| [[https://github.com/jmattheis/goverter][goverter]]                           | Generate type-safe Go converters by defining function signatures.                                                                                                                                                                                                                                                                                |
| [[https://github.com/bootdotdev/bootdev][bootdev]]                            | A CLI used to complete coding challenges and lessons on Boot.dev                                                                                                                                                                                                                                                                                 |
| [[https://github.com/doraemonkeys/WindSend][WindSend]]                           | Quickly and securely sync clipboard, transfer files and directories between devices. 快速安全的同步剪切板，传输文件或文件夹                                                                                                                                                                                                                            |
| [[https://github.com/tiny-craft/tiny-rdm][tiny-rdm]]                           | Tiny RDM (Tiny Redis Desktop Manager) - A modern, colorful, super lightweight Redis GUI client for Mac, Windows, and Linux.                                                                                                                                                                                                                      |
| [[https://github.com/Xmarmalade/alisthelper][alisthelper]]                        | Alist Helper is an application developed using Flutter, designed to simplify the use of the desktop version of alist. It can manage alist, allowing you to easily start and stop the alist program.                                                                                                                                              |
| [[https://github.com/royreznik/rexi][rexi]]                               | Terminal UI for Regex Testing                                                                                                                                                                                                                                                                                                                    |
| [[https://github.com/nwg-piotr/nwg-icon-picker][nwg-icon-picker]]                    | GTK icon chooser with a text search option                                                                                                                                                                                                                                                                                                       |
| [[https://github.com/fannheyward/coc-basedpyright][coc-basedpyright]]                   | Basedpyright extension for coc.nvim                                                                                                                                                                                                                                                                                                              |
| [[https://pkl-lang.org/][pkl]]                                | Configuration-as-code language with rich validation and tooling                                                                                                                                                                                                                                                                                  |
| [[https://github.com/skylersaleh/SkyEmu][SkyEmu]]                             | Game Boy Advance, Game Boy, Game Boy Color, and DS Emulator                                                                                                                                                                                                                                                                                      |
| [[https://www.xnview.com/en/xnviewmp/][xnviewmp]]                           | Efficient multimedia viewer, browser and converter                                                                                                                                                                                                                                                                                               |
| [[https://github.com/theobori/nix-converter][nix-converter]]                      | All-in-one converter configuration language to Nix and vice versa                                                                                                                                                                                                                                                                                |
| [[https://github.com/kriptolix/Poliedros][Poliedros]]                          | Multi-type dice roller                                                                                                                                                                                                                                                                                                                           |
| [[https://github.com/EnhancedJax/Bagels][Bagels]]                             | Powerful expense tracker that lives in your terminal.                                                                                                                                                                                                                                                                                            |
| [[https://github.com/tonikelope/megabasterd][megabasterd]]                        | Yet another unofficial (and ugly) cross-platform MEGA downloader/uploader/streaming suite.                                                                                                                                                                                                                                                       |
| [[https://github.com/monoamine11231/meowpdf][MeowPDF]]                            | A PDF viewer for the Kitty terminal with GUI-like usage and Vim-like keybindings written in Rust                                                                                                                                                                                                                                                 |
| [[https://github.com/freref/fancy-cat][fancy-cat]]                          | PDF reader for terminal emulators using the Kitty image protocol                                                                                                                                                                                                                                                                                 |
| [[https://github.com/hedhyw/go-import-lint][go-import-lint]]                     | Golang source code analyzer that checks imports order. It verifies that standard, current package, and vendor imports are separated by a line.                                                                                                                                                                                                   |
| [[https://github.com/JohnnyMorganz/luau-lsp][luau-lsp]]                           | Language Server Implementation for Luau                                                                                                                                                                                                                                                                                                          |
| [[https://github.com/dagimg-dot/gitsnip/][gitsnip]]                            | A CLI tool to download specific folders from a git repository.                                                                                                                                                                                                                                                                                   |
| [[https://gitlab.gnome.org/JanGernert/typewriter][typewriter]]                         | Create documents with typst, the new markup-based typesetting system that is powerful and easy to learn.                                                                                                                                                                                                                                         |
| [[https://github.com/pgbackrest/pgbackrest][pgbackrest]]                         | Reliable PostgreSQL Backup & Restore                                                                                                                                                                                                                                                                                                             |
| [[https://github.com/BurntSushi/biff][biff]]                               | A command line tool for datetime arithmetic, parsing, formatting and more.                                                                                                                                                                                                                                                                       |
| [[https://github.com/sjfhsjfh/typship][typship]]                            | A Typst package CLI tool                                                                                                                                                                                                                                                                                                                         |
| [[https://gitlab.com/ve-nt/outfieldr][outfieldr]]                          | A TLDR client written in Zig                                                                                                                                                                                                                                                                                                                     |
| [[https://github.com/Bali10050/Darkly][darkly]]                             | A modern style for qt applications.                                                                                                                                                                                                                                                                                                              |
| [[https://codeberg.org/q60/uwu_colors][uwu_colors]]                         | a dead simple language server to colorize hex color strings via textDocument/documentColor                                                                                                                                                                                                                                                       |
| [[https://github.com/tfkhdyt/geminicommit][geminicommit]]                       | CLI that writes git commit messages for you with Google Gemini AI                                                                                                                                                                                                                                                                                |
| [[https://github.com/zladovan/gorched][gorched]]                            | Gorched is terminal based game written in Go inspired by "The Mother of all games" Scorched Earth                                                                                                                                                                                                                                                |
| [[https://github.com/autobrr/mkbrr][mkbrr]]                              | ⚡ mkbrr is a tool to create, modify and inspect torrent files. Fast.                                                                                                                                                                                                                                                                            |
| [[https://github.com/MDeLuise/plant-it][plant-it]]                           | 🪴 Self-hosted, open source gardening companion app                                                                                                                                                                                                                                                                                              |
| [[https://github.com/bloxx12/dix][dix]]                                | Diff Nix                                                                                                                                                                                                                                                                                                                                         |
| [[https://github.com/Virviil/oci2git][oci2git]]                            | Introspecting Docker images as easy as using Git                                                                                                                                                                                                                                                                                                 |
| [[https://github.com/jelni/lucida-downloader][lucida-downloader]]                  | a multithreaded client for downloading music for free with https://lucida.to/.                                                                                                                                                                                                                                                                   |

#+name: need to be packaged
#+begin_src sqlite :db waiting.db :colnames yes
select * from v_need_packaging
#+end_src

#+RESULTS: need to be packaged
| package   | description                                                                                                                                                                                                  |
|-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [[https://github.com/vanadium23/kompanion][kompanion]] | a self hosted backend for bookworms, tightly coupled with KOReader                                                                                                                                           |
| [[https://github.com/sysid/bkmr][bkmr]]      | A Unified CLI Tool for Bookmark, Snippet, and Knowledge Management                                                                                                                                           |
| [[https://github.com/aethiopicuschan/nocjk][nocjk]]     | Detect CJK text                                                                                                                                                                                              |
| [[https://github.com/kantord/zeitgrep][zeitgrep]]  | sorted grep                                                                                                                                                                                                  |
| [[https://github.com/Skardyy/mcat][mcat]]      | cat command for documents / images / videos and more!                                                                                                                                                        |
| [[https://github.com/antoniorodr/lexy][lexy]]      | Lexy is a lightweight CLI tool that fetches programming tutorials from "Learn X in Y Minutes" directly into your terminal. Quickly search, learn, and reference code examples without leaving your workflow. |

#+RESULTS: waiting to be packaged
| package   | description                                                        |
|-----------+--------------------------------------------------------------------|
| [[https://github.com/vanadium23/kompanion][kompanion]] | a self hosted backend for bookworms, tightly coupled with KOReader |
